Revit 2026 API

# StdPostedWarning Properties

---

The StdPostedWarning type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

StdPostedWarning Class

Autodesk.Revit.DB Namespace